source/_posts/2016-05-04-mac-os-x-proxychains-not-working.html
---
title: "mac os x proxychains 命令行下无法代理原因"
date: 2016-05-04
layout: post
categories: 
- mac
tags: 
- mac
published: true
comments: true
---
<p>
最近打算用docker搭1个反向代理google的服务。网上找了一些命令行下代理的方案。采用的proxychains-ng，使用中发现无法翻墙。
</p>

<p>
<!-- more -->
</p>

<p>
具体配置方案这里就不写了。
</p>

<p>
google 关键字 <b>proxychains-ng not working</b> 找到有人提了issue
</p>

<p>
<a href="https://github.com/rofl0r/proxychains-ng/issues/78">Not working on OS X 10.11. due to SIP</a>
</p>

<p>
接着看下SIP资料 <a href="https://support.apple.com/en-us/HT204899">About System Integrity Protection on your Mac</a>
</p>

<p>
继续翻翻有2种解决方案
</p>

<ol class="org-ol">
<li>关闭SIP</li>
</ol>
<p>
<a href="http://apple.stackexchange.com/questions/208478/how-do-i-disable-system-integrity-protection-sip-aka-rootless-on-os-x-10-11">how do i disable System Integrity Protection(SIP) AKA "rootless" on OS X 10.11, EI Capitan?</a>
</p>

<ol class="org-ol">
<li>不用受保护目录下的命令</li>
</ol>

<div class="org-src-container">

<pre class="src src-shell">proxychains4 /usr/local/Cellar/curl/7.48.0/bin/curl http://ifconfig.co
</pre>
</div>

<p>
解决
</p>
